test-plan/sideexSamplerTestPlanSample.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="sideexTestPlan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <team.sideex.config.SideexRunnerConfig guiclass="team.sideex.config.SideexRunnerConfigGui" testclass="team.sideex.config.SideexRunnerConfig" testname="@sideex - SideexRunnerConfig" enabled="true">
        <stringProp name="RUNNER_EXE_PATH">/Users/user/sideex-things/runner-testcase/runner-executable-file-oneline/sideex-runner-linux</stringProp>
        <stringProp name="SELENIUM_PORT">http://127.0.0.1:4445</stringProp>
      </team.sideex.config.SideexRunnerConfig>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <team.sideex.sampler.SideexSampler guiclass="team.sideex.sampler.SideexSamplerGui" testclass="team.sideex.sampler.SideexSampler" testname="@sideex - SideexSampler" enabled="true">
          <stringProp name="TC_FILE_PATH">/Users/user/sideex-testcase/suiteOpenWebsite.json</stringProp>
          <stringProp name="BROWSER_SELECT">Chrome</stringProp>
        </team.sideex.sampler.SideexSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <team.sideex.reporter.SideexSamplerResultCollector guiclass="team.sideex.reporter.SideexSamplerResultReporterGui" testclass="team.sideex.reporter.SideexSamplerResultCollector" testname="@sideex - SamplerResultReport" enabled="true"/>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>